run/pressureBuildupFoam/stoneColumn_b/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    seaBed
    {
        type            wall;
        nFaces          100;
        startFace       9850;
    }
    frontBack
    {
        type            empty;
        nFaces          10000;
        startFace       9950;
    }
    soilDomainBottom
    {
        type            wall;
        nFaces          100;
        startFace       19950;
    }
    sides
    {
        type            cyclic;
        nFaces          100;
        startFace       20050;
        featureCos      0.9;
    }
)


// ************************************************************************* //
