run/pressureBuildupFoam/stoneColumn_b/constant/rheologyProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      rheologyProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

planeStress     no;

rheology
{
    type                    multiMaterial;

    laws
    (
        soil
        {
            type            poroElastic;
            rho             rho [1 -3 0 0 0 0 0] -1; // not used
            E               E [1 -1 -2 0 0 0 0] 2.5e+6;
            nu              nu [0 0 0 0 0 0 0] 0.35;
            n               n [0 0 0 0 0 0 0] 0.333;
            k               k [0 1 -1 0 0 0 0] 1e-6;
        }

        stones
        {
            type            poroElastic;
            rho             rho [1 -3 0 0 0 0 0] -1; // not used
            //E               E [1 -1 -2 0 0 0 0] 2.5e+6;
            //nu              nu [0 0 0 0 0 0 0] 0.35;
            //n               n [0 0 0 0 0 0 0] 0.333;
            //k               k [0 1 -1 0 0 0 0] 1e-6;
            E               E [1 -1 -2 0 0 0 0] 2e7;
            nu              nu [0 0 0 0 0 0 0] 0.33;
            n               n [0 0 0 0 0 0 0] 0.32;
            k               k [0 1 -1 0 0 0 0] 0.01;
        }
    );
}


// ************************************************************************* //
