run/pressureBuildupFoam/stoneColumn_b/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue materials 0
    volVectorFieldValue U (0 0 0)
);

regions
(
    boxToCell
    {
        box ( 43.5  0  -1 ) ( 45.24 0.5  0);

        fieldValues
        (
            volScalarFieldValue materials 1
        );
    }
    boxToCell
    {
        box (132.24 0  -1 ) (133.98 0.5  0);

        fieldValues
        (
            volScalarFieldValue materials 1
        );
    }
    
        boxToCell
    {
        box (85.26 0  -1 ) (88.74 0.5  0);

        fieldValues
        (
            volScalarFieldValue materials 1
        );
    }
    
    
);


// ************************************************************************* //
