run/pressureBuildupFoam/stoneColumn_b/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(


 {

    {
        name    solidCellSet;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
                      
             box (26.1 0 -1)(27.84 0.5 0);
        }
    }
    
    {
        name    solidZones;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        sourceInfo
        {
            set solidCellSet;
          
        }
    }
















);

// ************************************************************************* //
